blog/artificial-universe-introduction.project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-02 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Protoverse Project</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Creating an alternate universe from scratch." />
<meta name="keywords" content="computable universe, alternate reality, alife, alternative universe, non-biological evolution, selection, emergence, nonlinear dynamic systems, chaos theory, metaphysics" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/cormorant/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/gentium-basic/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/mononoki/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/artificial-universe-introduction.project.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2024-01-31">Last updated: 2024-01-31</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">The Protoverse Project</h1>
<p class="subtitle" role="doc-subtitle">Introduction</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaae6689">What is This Place?</a>
<ul>
<li><a href="#orge87d592">Core Ideas</a></li>
<li><a href="#org375a4d6">Project Details</a></li>
</ul>
</li>
<li><a href="#orgbf50731">FAQ</a>
<ul>
<li><a href="#org263ec1a">Why?</a></li>
<li><a href="#orgc38f80e">If it is Not Based on Physics — Then What?</a></li>
<li><a href="#org72c70a7">But isn&rsquo;t that speculation? Not Science?</a></li>
<li><a href="#org8676a23">What is it good for? How can it be applied?</a></li>
<li><a href="#org5562c8c">How do you fund that?</a></li>
<li><a href="#org1371d7c">Don&rsquo;t you have ethical concerns?</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgaae6689" class="outline-2">
<h2 id="orgaae6689"><a href="#orgaae6689">What is This Place?</a></h2>
<div class="outline-text-2" id="text-orgaae6689">
<p>
<b>What this is <i>not</i>:</b><br>
</p>
<ul class="org-ul">
<li>has nothing to do with &ldquo;metaverse&rdquo;-style virtual reality;<br></li>
<li>this won&rsquo;t be simulating our universe with celestial bodies;<br></li>
<li>is no simulator of physical laws or quantum mechanics;<br></li>
</ul>

<p>
The Protoverse is a computational experiment with the intent to build an artificial, abstract universe from scratch. It&rsquo;s not a simulation of anything, rather the actual system yet to exist.<br>
</p>
</div>

<div id="outline-container-orge87d592" class="outline-3">
<h3 id="orge87d592"><a href="#orge87d592">Core Ideas</a></h3>
<div class="outline-text-3" id="text-orge87d592">
<p>
The world is not made from &ldquo;things&rdquo;, but processes &#x2014; the Protoverse represents a shift from a substantial-materialist worldview to a process-relational understanding of reality <i>(Process philosophy)</i>.<br>
</p>

<p>
<b>Universal Darwinism:</b>   &#x2014;<br>
</p>

<p>
<b>Backdrop Independence:</b>  &#x2014;<br>
</p>
</div>
</div>

<div id="outline-container-org375a4d6" class="outline-3">
<h3 id="org375a4d6"><a href="#org375a4d6">Project Details</a></h3>
<div class="outline-text-3" id="text-org375a4d6">
<ul class="org-ul">
<li><a href="artificial-universe-metaphysics.project.html">Metaphysical Framework</a><br></li>
<li><a href="artificial-universe-engineering.project.html">Engineering</a><br></li>
<li><a href="artificial-universe-ethics.project.html">Ethical Guidelines</a><br></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbf50731" class="outline-2">
<h2 id="orgbf50731"><a href="#orgbf50731">FAQ</a></h2>
<div class="outline-text-2" id="text-orgbf50731">
</div>
<div id="outline-container-org263ec1a" class="outline-3">
<h3 id="org263ec1a"><a href="#org263ec1a">Why?</a></h3>
<div class="outline-text-3" id="text-org263ec1a">
<p>
I got bored with my &ldquo;learning programming for absolute beginners&rdquo;-projects, so I thought maybe I should do stuff that I actually want to do. If you want, you can view it as &ldquo;a beginner&rsquo;s first endavour in neatly entangled metaphysics, complex adaptive systems, universal darwinism, chaos theory, automata theory, quantum physics and -metaphysics, the origins of life, artificial life and beyond&rdquo;.<br>
</p>

<p>
Well, there are quite a bit more &ldquo;whys&rdquo; than just that, but they come and go. And you could even distill your own &ldquo;whys&rdquo; from the ideas touched upon in the <a href="artificial-universe-metaphysics.project.html">metaphysical framework</a>.<br>
</p>
</div>
</div>

<div id="outline-container-orgc38f80e" class="outline-3">
<h3 id="orgc38f80e"><a href="#orgc38f80e">If it is Not Based on Physics — Then What?</a></h3>
<div class="outline-text-3" id="text-orgc38f80e">
<p>
The Protoverse <i>may have</i> parallels with physical models. It is purely abstract, but that doesn&rsquo;t mean crazy exotic or totally absurd (well, not yet). You might even find the modest <a href="artificial-universe-metaphysics.project.html">ontology</a> boring. The motivation is more all-encompassing — it explores systems defined by dynamically evolving rules, regardless of the realm they have been assigned to. Its approach draws upon concepts of complexity, adaptation, and evolution to address diverse systems that can change. Hence, it&rsquo;s not limited to the branch of physics alone, but more about modeling a literal &ldquo;possible universe&rdquo; marked by dynamic complexity and evolution.<br>
</p>
</div>
</div>

<div id="outline-container-org72c70a7" class="outline-3">
<h3 id="org72c70a7"><a href="#org72c70a7">But isn&rsquo;t that speculation? Not Science?</a></h3>
<div class="outline-text-3" id="text-org72c70a7">
<p>
In a sense, speculation can be seen as a type of intellectual creativity, while creativity often involves a form of speculative thinking. Speculation can do a couple of tricks. E.g. it allows you to form theories without firm evidence. You can violate rules and play with inconherence, not unlike flying without casting a shadow for a while. It has its place in the ongoing feedback loop next to philosophical, mathematical and scientific methods, which should lead to the implementation of the Protoverse by means of engineering.<br>
</p>
</div>
</div>

<div id="outline-container-org8676a23" class="outline-3">
<h3 id="org8676a23"><a href="#org8676a23">What is it good for? How can it be applied?</a></h3>
<div class="outline-text-3" id="text-org8676a23">
<p>
I don&rsquo;t know yet (that&rsquo;s what I consider a fun project). The work on the Protoverse could bring up some new perspectives. Once implemented, the Protoverse could help to gain deeper insights into the nature of real-world systems and phenomena, from social/economical systems to the evolution of life and the universe itself.<br>
</p>
</div>
</div>

<div id="outline-container-org5562c8c" class="outline-3">
<h3 id="org5562c8c"><a href="#org5562c8c">How do you fund that?</a></h3>
<div class="outline-text-3" id="text-org5562c8c">
<p>
The Protoverse project will at any time receive the attention it deserves and the degree of funding needed.<br>
</p>

<ol class="org-ol">
<li>The first rule of the Protoverse is: You do not talk about the Protoverse.<br></li>
<li>The second rule of the Protoverse is: You do not talk about the Protoverse.<br></li>
<li>Third rule: Rules are subject to evolution and lead to higher-order, emergent phenomena.<br></li>
</ol>
</div>
</div>

<div id="outline-container-org1371d7c" class="outline-3">
<h3 id="org1371d7c"><a href="#org1371d7c">Don&rsquo;t you have ethical concerns?</a></h3>
<div class="outline-text-3" id="text-org1371d7c">
<p>
I suggest to treat ethical questions not separately, but as questions arising naturally from actual phenomena, which need to be adressed in the context of the Protoverse itself. That doesn&rsquo;t rule out the option of <i>adaption</i> to a broader context or other systems.<br>
</p>

<p>
From my view, it would be a futile endavour trying to work out all-encompassing, detailled ethical rules for co-existence with potential Artificial General Intelligence and non-biological life, without any knowledge <i>how it will be</i>; analogous to politicians tasked to &ldquo;regulate the internet&rdquo;. My best guess on how AI will be: <i>Vastly. Diverse.</i>)<br>
</p>

<p>
Check out the ongoing development of the <a href="artificial-universe-ethics.project.html">Ethical Guidelines for the Protoverse Project</a>.<br>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author">Dan Dee</span> <span class="email"><a href="mailto:MonkeyJungleJuice@pm.me">MonkeyJungleJuice@pm.me</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
